Revit 2022 API
AnalyticalModelSurface.GetHiddenOpenings Method
 Retrieves Identifiers of all hidden openings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public void GetHiddenOpenings(
	out ICollection<ElementId> openingsIds
)
Visual Basic
Public Sub GetHiddenOpenings ( _
	<OutAttribute> ByRef openingsIds As ICollection(Of ElementId) _
)
Visual C++
public:
void GetHiddenOpenings(
	[OutAttribute] ICollection<ElementId^>^% openingsIds
)
Parameters
openingsIds
Type: System.Collections.Generic.ICollection<ElementId>
 Set of openings Identifiers which are hidden in Analytical Surface Element.
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace